In [0]:
!pip install nominally

import pandas as pd
from nominally import Name, parse_name

Collecting nominally
  Downloading https://files.pythonhosted.org/packages/39/95/66df5b4856b47d78930b8afd154fd5659a66b3bcccf49924a47e50226732/nominally-0.9.4-py3-none-any.whl
Collecting unidecode==1.1.1 (from nominally)
  Downloading https://files.pythonhosted.org/packages/d0/42/d9edfed04228bacea2d824904cae367ee9efd05e6cce7ceaaedd0b0ad964/Unidecode-1.1.1-py2.py3-none-any.whl (238kB)
     |████████████████████████████████| 245kB 7.9MB/s
Installing collected packages: unidecode, nominally
Successfully installed nominally-0.9.4 unidecode-1.1.1

In [0]:
Name("Dr Gert Van Der Whoops")

Name({'title': 'dr', 'first': 'gert', 'middle': '', 'last': 'van der whoops', 'suffix': '', 'nickname': ''})

In [0]:
def parse_to_columns(s):
    return pd.Series({**parse_name(s)})

parse_to_columns("Dr Gert Van Der Whoops")

title                   dr
first                 gert
middle
last        van der whoops
suffix
nickname
dtype: object

In [0]:
raw_names = [
    "Graham Arthur Chapman",
    "cleese, john m",
    "Gilliam, Terrence (Terry) Vance",
    "Eric Idle",
    'Mr. Terence "Terry" Graham Parry Jones',
    "M E Palin",
    "Neil James Innes",
    "carol cleveland",
    "Adams, Douglas N",
]
raw_series = pd.Series(raw_names)
raw_series

0                     Graham Arthur Chapman
1                            cleese, john m
2           Gilliam, Terrence (Terry) Vance
3                                 Eric Idle
4    Mr. Terence "Terry" Graham Parry Jones
5                                 M E Palin
6                          Neil James Innes
7                           carol cleveland
8                          Adams, Douglas N
dtype: object

In [0]:
parsed_df = raw_series.apply(parse_to_columns)
result = pd.DataFrame(raw_series).join(parsed_df)
result

                                        0 title  ... suffix nickname
0                   Graham Arthur Chapman        ...
1                          cleese, john m        ...
2         Gilliam, Terrence (Terry) Vance        ...           terry
3                               Eric Idle        ...
4  Mr. Terence "Terry" Graham Parry Jones    mr  ...           terry
5                               M E Palin        ...
6                        Neil James Innes        ...
7                         carol cleveland        ...
8                        Adams, Douglas N        ...

[9 rows x 7 columns]